literate-programs/10-09-Introduction-to-Ruby.org
#+Title: Introduction to Ruby
#+Author: Mark Armstrong
#+Description: A brief tour of Ruby.
#+SETUPFILE: ../../org-html-themes/setup/theme-readtheorg-local.setup

* LaTeX settings                                :noexport:

#+LaTeX_header: \usepackage{unicode-math}
#+LaTeX_header: \usepackage{unicode}

* Introduction
:PROPERTIES:
:CUSTOM_ID: Introduction
:END:

These notes were created for, and in some parts *during*,
the lecture on October 9th and the following tutorials.

* Motivation
:PROPERTIES:
:CUSTOM_ID: Motivation
:END:

So far, we have been investigating
- the functional paradigm, using Scala,
  - which happens to also be a pure object-oriented language, and
- the logical paradigm, using Prolog.

We now investigate an /imperative/ pure object-oriented language, Ruby.

Ruby's syntax is also heavily influenced by Lisp,
and the final language we will investigate later in the course
is a Lisp.
So Ruby acts as a stepping stone to that point.

* Background on Ruby
:PROPERTIES:
:CUSTOM_ID: Background-on-Ruby
:END:

Ruby is an almost purely object-oriented language,
heavily inspired by Smalltalk, Lisp and Perl.

It's creator, Yukihiro “Matz” Matsumoto,
has documented these inspirations in
[[http://blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-talk/179642][a post on ruby-talk]].
#+begin_quote
Ruby is a language designed in the following steps:

  * take a simple lisp language (like one prior to CL).
  * remove macros, s-expression.
  * add simple object system (much simpler than CLOS).
  * add blocks, inspired by higher order functions.
  * add methods found in Smalltalk.
  * add functionality found in Perl (in OO way).
#+end_quote

Ruby was a language born out of Matz's interests
and love of certain language features.
He's [[https://ruby-doc.org/docs/ruby-doc-bundle/FAQ/FAQ.html][said]]
about its creation
#+begin_quote
Well, Ruby was born on February 24 1993.
I was talking with my colleague about the possibility of
an object-oriented scripting language.
I knew Perl (Perl4, not Perl5), but I didn't like it really,
because it had smell of toy language (it still has).
The object-oriented scripting language seemed very promising.

I knew Python then. But I didn't like it,
because I didn't think it was a true object-oriented language
─ OO features appeared to be add-on to the language.
As a language manic and OO fan for 15 years,
I really wanted a genuine object-oriented,
easy-to-use scripting language.
I looked for, but couldn't find one.

So, I decided to make it.
It took several months to make the interpreter run.
I put it the features I love to have in my language,
such as iterators, exception handling, garbage collection.

Then, I reorganized the features of Perl into a class library,
and implemented them. I posted Ruby 0.95 to
the Japanese domestic newsgroups in Dec. 1995.
#+end_quote

* General syntax
:PROPERTIES:
:CUSTOM_ID: General-syntax
:END:

See the
[[https://docs.ruby-lang.org/en/2.4.0/syntax_rdoc.html][Ruby documentation]]
for a good overview of the syntax. We try to cover
the most important parts here and in the following sections.

Ruby, being a “scripting language”, has a somewhat C-like syntax
that may remind you of Python or possibly Javascript.

The major difference between Ruby and Python
is that whitespace does not indicate structure in Ruby.

Instead, to indicate the beginning and ending of a scope,
we use ~begin~ and ~end~ keywords.
(~begin~ is not used if there is already an indication
of the beginning of the scope.)
#+begin_src ruby :results output
# Denote the end of a method with an end keyword
# begin is not used, since we have a def.
def f(x)
  return x
end

puts f(5)
#+end_src

#+RESULTS:
: 5

Ruby has a good variety of control structures.
#+begin_src ruby :results output
if (true)
  puts "hello"
end

if false
  puts "goodbye"
elsif true
  puts "world"
else
  puts "I don't get here."
end

# There is the "ternary if"
true ? puts("first one") : puts("second one")
x = true ? "first one" : "second one"
puts x

# It's not needed really.
y = if true then "this works" else "or does it?" end
puts y

# We don't need to negate conditions; we have an unless operator
unless true
  puts "The meaning of life"
else
  puts "You're out of luck"
end

# There is a switch statement
x = 12345
case x
when 12345
  puts "here we are"
when 123
  puts "not here"
else
  puts "and not here"
end
#+end_src

#+RESULTS:
: hello
: world
: first one
: first one
: this works
: You're out of luck
: here we are

Not discussed here:
- ~while~ loops
- ~until~ loops
- ~for~ loops
- ~break~ statements
- ~next~ statements
  - (skips to the next iteration in a loop.)

