literate-programs/10-09-Introduction-to-Ruby.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-20 Tue 23:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Ruby</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="A brief tour of Ruby."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introduction to Ruby</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#Background-on-Ruby">3. Background on Ruby</a></li>
<li><a href="#General-syntax">4. General syntax</a></li>
<li><a href="#Dynamic-typing,-heterogenous-collections">5. Dynamic typing, heterogenous collections</a></li>
<li><a href="#“Purely-object-oriented”">6. “Purely object-oriented”</a>
<ul>
<li><a href="#Integers-are-objects,-operations-are-methods">6.1. Integers are objects, operations are methods</a></li>
<li><a href="#Integers-are-objects,-operations-are-/messages/">6.2. Integers are objects, operations are <i>messages</i></a></li>
</ul>
</li>
<li><a href="#Output-methods">7. Output methods</a></li>
<li><a href="#Postfix-forms">8. Postfix forms</a></li>
<li><a href="#Method-naming-conventions">9. Method naming conventions</a></li>
<li><a href="#Defining-classes">10. Defining classes</a>
<ul>
<li><a href="#The-basics">10.1. The basics</a></li>
<li><a href="#Inheritance">10.2. Inheritance</a></li>
<li><a href="#Mixins">10.3. <span class="todo TODO">TODO</span> Mixins</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created for, and in some parts <b>during</b>,
the lecture on October 9th and the following tutorials.
</p>
</div>
</div>

<div id="outline-container-Motivation" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
<p>
So far, we have been investigating
</p>
<ul class="org-ul">
<li>the functional paradigm, using Scala,
<ul class="org-ul">
<li>which happens to also be a pure object-oriented language, and</li>
</ul></li>
<li>the logical paradigm, using Prolog.</li>
</ul>

<p>
We now investigate an <i>imperative</i> pure object-oriented language, Ruby.
</p>

<p>
Ruby's syntax is also heavily influenced by Lisp,
and the final language we will investigate later in the course
is a Lisp.
So Ruby acts as a stepping stone to that point.
</p>
</div>
</div>

<div id="outline-container-Background-on-Ruby" class="outline-2">
<h2 id="Background-on-Ruby"><span class="section-number-2">3</span> Background on Ruby</h2>
<div class="outline-text-2" id="text-Background-on-Ruby">
<p>
Ruby is an almost purely object-oriented language,
heavily inspired by Smalltalk, Lisp and Perl.
</p>

<p>
It's creator, Yukihiro “Matz” Matsumoto,
has documented these inspirations in
<a href="http://blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-talk/179642">a post on ruby-talk</a>.
</p>
<blockquote>
<p>
Ruby is a language designed in the following steps:
</p>

<ul class="org-ul">
<li>take a simple lisp language (like one prior to CL).</li>
<li>remove macros, s-expression.</li>
<li>add simple object system (much simpler than CLOS).</li>
<li>add blocks, inspired by higher order functions.</li>
<li>add methods found in Smalltalk.</li>
<li>add functionality found in Perl (in OO way).</li>
</ul>
</blockquote>

<p>
Ruby was a language born out of Matz's interests
and love of certain language features.
He's <a href="https://ruby-doc.org/docs/ruby-doc-bundle/FAQ/FAQ.html">said</a>
about its creation
</p>
<blockquote>
<p>
Well, Ruby was born on February 24 1993.
I was talking with my colleague about the possibility of
an object-oriented scripting language.
I knew Perl (Perl4, not Perl5), but I didn't like it really,
because it had smell of toy language (it still has).
The object-oriented scripting language seemed very promising.
</p>

<p>
I knew Python then. But I didn't like it,
because I didn't think it was a true object-oriented language
─ OO features appeared to be add-on to the language.
As a language manic and OO fan for 15 years,
I really wanted a genuine object-oriented,
easy-to-use scripting language.
I looked for, but couldn't find one.
</p>

<p>
So, I decided to make it.
It took several months to make the interpreter run.
I put it the features I love to have in my language,
such as iterators, exception handling, garbage collection.
</p>

<p>
Then, I reorganized the features of Perl into a class library,
and implemented them. I posted Ruby 0.95 to
the Japanese domestic newsgroups in Dec. 1995.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-General-syntax" class="outline-2">
<h2 id="General-syntax"><span class="section-number-2">4</span> General syntax</h2>
<div class="outline-text-2" id="text-General-syntax">
<p>
See the
<a href="https://docs.ruby-lang.org/en/2.4.0/syntax_rdoc.html">Ruby documentation</a>
for a good overview of the syntax. We try to cover
the most important parts here and in the following sections.
</p>

<p>
Ruby, being a “scripting language”, has a somewhat C-like syntax
that may remind you of Python or possibly Javascript.
</p>

<p>
The major difference between Ruby and Python
is that whitespace does not indicate structure in Ruby.
</p>

<p>
Instead, to indicate the beginning and ending of a scope,
we use <code>begin</code> and <code>end</code> keywords.
(<code>begin</code> is not used if there is already an indication
of the beginning of the scope.)
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Denote the end of a method with an end keyword</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">begin is not used, since we have a def.</span>
<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">f</span><span style="color: #00cd68;">(</span>x<span style="color: #00cd68;">)</span>
  <span style="color: #b6a0ff;">return</span> x
<span style="color: #b6a0ff;">end</span>

<span style="color: #f78fe7;">puts</span> f<span style="color: #00cd68;">(</span>5<span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
Ruby has a good variety of control structures.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">if</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">true</span><span style="color: #00cd68;">)</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"hello"</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #b6a0ff;">if</span> <span style="color: #00bcff;">false</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"goodbye"</span>
<span style="color: #b6a0ff;">elsif</span> <span style="color: #00bcff;">true</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"world"</span>
<span style="color: #b6a0ff;">else</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"I don't get here."</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">There is the "ternary if"</span>
<span style="color: #00bcff;">true</span> ? <span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"first one"</span><span style="color: #00cd68;">)</span> : <span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"second one"</span><span style="color: #00cd68;">)</span>
x = <span style="color: #00bcff;">true</span> ? <span style="color: #79a8ff;">"first one"</span> : <span style="color: #79a8ff;">"second one"</span>
<span style="color: #f78fe7;">puts</span> x

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">It's not needed really.</span>
y = <span style="color: #b6a0ff;">if</span> <span style="color: #00bcff;">true</span> <span style="color: #b6a0ff;">then</span> <span style="color: #79a8ff;">"this works"</span> <span style="color: #b6a0ff;">else</span> <span style="color: #79a8ff;">"or does it?"</span> <span style="color: #b6a0ff;">end</span>
<span style="color: #f78fe7;">puts</span> y

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">We don't need to negate conditions; we have an unless operator</span>
<span style="color: #b6a0ff;">unless</span> <span style="color: #00bcff;">true</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"The meaning of life"</span>
<span style="color: #b6a0ff;">else</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"You're out of luck"</span>
<span style="color: #b6a0ff;">end</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">There is a switch statement</span>
x = 12345
<span style="color: #b6a0ff;">case</span> x
<span style="color: #b6a0ff;">when</span> 12345
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"here we are"</span>
<span style="color: #b6a0ff;">when</span> 123
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"not here"</span>
<span style="color: #b6a0ff;">else</span>
  <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"and not here"</span>
<span style="color: #b6a0ff;">end</span>
</pre>
</div>

<p>
Not discussed here:
</p>
<ul class="org-ul">
<li><code>while</code> loops</li>
<li><code>until</code> loops</li>
<li><code>for</code> loops</li>
<li><code>break</code> statements</li>
<li><code>next</code> statements
<ul class="org-ul">
<li>(skips to the next iteration in a loop.)</li>
</ul></li>
</ul>
</div>
</div>
