literate-programs/10-09-Introduction-to-Ruby.org
* Dynamic typing, heterogenous collections
:PROPERTIES:
:CUSTOM_ID: Dynamic-typing,-heterogenous-collections
:END:

In most languages, lists, arrays and (hash)maps
are /homogenous/ collections; they include only one type of element.

This is not the case in a dynamic (typed) language
such as Ruby.

So we can have arrays and maps with multiple types.
#+begin_src ruby :results output
a = ["Arrays", :can, "contain", 1, "or more different types"] 
h = {:and => "So can hashes.", "see" => a, 0 => 12345}

print a
print "\n"
print h
#+end_src

#+RESULTS:
: ["Arrays", :can, "contain", 1, "or more different types"]
: {:and=>"So can hashes.", "see"=>["Arrays", :can, "contain", 1, "or more different types"], 0=>12345}

* “Purely object-oriented”
:PROPERTIES:
:CUSTOM_ID: “Purely-object-oriented”
:END:

** Preamble                                    :ignore:

What does it mean when I have said, both about Ruby and Scala,
that they are purely object oriented?

Quite simply, that all /data/ is represented as an /object,
and all operations are /methods/!

Another view of this: all data is objects,
and all operations are messages between objects.

** Integers are objects, operations are methods
:PROPERTIES:
:CUSTOM_ID: Integers-are-objects,-operations-are-methods
:END:

For instance, consider integers, which in many languages are
a /basic/, /builtin/ type that do not have an implementation
within the language. This is not the case in a pure language!
In both Ruby and Scala, integers are objects,
and operations on them are methods.

So code such as
#+begin_src ruby :session
5 + 8
#+end_src

#+RESULTS:
: 13

or in Scala,
#+begin_src amm
5 + 2
#+end_src

#+RESULTS:
: res1: Int = 7

could instead be written
#+begin_src ruby :session
5.+(9)
#+end_src

#+RESULTS:
: 14

#+begin_src amm
5.+(2)
#+end_src

#+RESULTS:
: res3: Int = 7

that is, ~+~ is a method of the first argument, being passed
the second argument as a parameter.
The form ~x ⊕ y~ is just /syntactic sugar/.

** Integers are objects, operations are /messages/
:PROPERTIES:
:CUSTOM_ID: Integers-are-objects,-operations-are-/messages/
:END:

In Ruby, we can move one level of abstraction higher:
all data are objects, and all operations
are /messages between objects/.
This harkens back to SmallTalk, one of the founding languages
of the object oriented paradigm.
#+begin_src ruby :session
5.send("+", 3)
#+end_src

#+RESULTS:
: 8

So even the form ~x.⊕(y)~ is syntactic sugar!

In Scala, moving to this message passing abstraction
is not possible, at least not easily; why?
- Answer: because Scala is statically typed!
  It is unlikely the typechecker will parse a string
  to see what method is being invoked.
  - And even if we wanted to make the typechecker do so,
    that only handles to case of constant strings;
    what if the string is constructed earlier in the program,
    or its value is given as an argument?

* Output methods
:PROPERTIES:
:CUSTOM_ID: Output-methods
:END:

There are at least three useful output methods in Ruby.
- ~print~ prints out an object without a newline at the end.
- ~puts~ does output a newline, and on arrays, outputs each element
  on its own line.
- ~p~ just outputs raw objects.
#+begin_src ruby :results output
print(["Prints", "out", "the", "object", "without", "a", "new", "line"])
print "\n"

puts(["Each", "element", "on", "a", "newline"])
puts "And a newline at the end as well."
puts "See?"

print "Outputs a string with a newline\n"
p "Outputs the raw string\n"
#+end_src

#+RESULTS:
#+begin_example
["Prints", "out", "the", "object", "without", "a", "new", "line"]
Each
element
on
a
newline
And a newline at the end as well.
See?
Outputs a string with a newline
"Outputs the raw string\n"
#+end_example

* Postfix forms
:PROPERTIES:
:CUSTOM_ID: Postfix-forms
:END:

One nice feature of Ruby is that it has
an abuntant amount of syntactic sugar.
For instance, we have the standard control structures
such as ~if~:
#+begin_src ruby :results output
x = if 2 + 3 == 5
      "2 + 3 is 5; good"
    elsif 2 + 3 == 6
      "oh no!!!"
    else
      "oh no"
    end

print("x is: ", x)
#+end_src

#+RESULTS:
: x is 2 + 3 is 5; good

If you are only using a “then” branch, you can write
the ~if~ after the body.
#+begin_src ruby :results output
puts("1 + 1 is 2") if 1 + 1 == 2
#+end_src

#+RESULTS:
: 1 + 1 is 2


We can do the same with at least some of the loops
#+begin_src ruby :results output
x = 0
y = 0

x = x + 1 while x < 10
while y < 10 do y = y + 1 end

puts(x)
puts(y)
#+end_src

#+RESULTS:
: 10
: 10

