literate-programs/10-09-Introduction-to-Ruby.html

<div id="outline-container-Dynamic-typing,-heterogenous-collections" class="outline-2">
<h2 id="Dynamic-typing,-heterogenous-collections"><span class="section-number-2">5</span> Dynamic typing, heterogenous collections</h2>
<div class="outline-text-2" id="text-Dynamic-typing,-heterogenous-collections">
<p>
In most languages, lists, arrays and (hash)maps
are <i>homogenous</i> collections; they include only one type of element.
</p>

<p>
This is not the case in a dynamic (typed) language
such as Ruby.
</p>

<p>
So we can have arrays and maps with multiple types.
</p>
<div class="org-src-container">
<pre class="src src-ruby">a = <span style="color: #00cd68;">[</span><span style="color: #79a8ff;">"Arrays"</span>, <span style="color: #00bcff;">:can</span>, <span style="color: #79a8ff;">"contain"</span>, 1, <span style="color: #79a8ff;">"or more different types"</span><span style="color: #00cd68;">]</span> 
h = <span style="color: #00cd68;">{</span><span style="color: #00bcff;">:and</span> =&gt; <span style="color: #79a8ff;">"So can hashes."</span>, <span style="color: #79a8ff;">"see"</span> =&gt; a, 0 =&gt; 12345<span style="color: #00cd68;">}</span>

<span style="color: #f78fe7;">print</span> a
<span style="color: #f78fe7;">print</span> <span style="color: #79a8ff;">"\n"</span>
<span style="color: #f78fe7;">print</span> h
</pre>
</div>
</div>
</div>

<div id="outline-container-“Purely-object-oriented”" class="outline-2">
<h2 id="“Purely-object-oriented”"><span class="section-number-2">6</span> “Purely object-oriented”</h2>
<div class="outline-text-2" id="text-“Purely-object-oriented”">
<p>
What does it mean when I have said, both about Ruby and Scala,
that they are purely object oriented?
</p>

<p>
Quite simply, that all <i>data</i> is represented as an <i>object,
and all operations are /methods</i>!
</p>

<p>
Another view of this: all data is objects,
and all operations are messages between objects.
</p>
</div>

<div id="outline-container-Integers-are-objects,-operations-are-methods" class="outline-3">
<h3 id="Integers-are-objects,-operations-are-methods"><span class="section-number-3">6.1</span> Integers are objects, operations are methods</h3>
<div class="outline-text-3" id="text-Integers-are-objects,-operations-are-methods">
<p>
For instance, consider integers, which in many languages are
a <i>basic</i>, <i>builtin</i> type that do not have an implementation
within the language. This is not the case in a pure language!
In both Ruby and Scala, integers are objects,
and operations on them are methods.
</p>

<p>
So code such as
</p>
<div class="org-src-container">
<pre class="src src-ruby">5 + 8
</pre>
</div>

<p>
or in Scala,
</p>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #00bcff;">5</span> + <span style="color: #00bcff;">2</span>
</pre>
</div>

<p>
could instead be written
</p>
<div class="org-src-container">
<pre class="src src-ruby">5.+<span style="color: #00cd68;">(</span>9<span style="color: #00cd68;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-amm"><span style="color: #00bcff;">5.</span>+<span style="color: #00cd68;">(</span><span style="color: #00bcff;">2</span><span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
that is, <code>+</code> is a method of the first argument, being passed
the second argument as a parameter.
The form <code>x ⊕ y</code> is just <i>syntactic sugar</i>.
</p>
</div>
</div>

<div id="outline-container-Integers-are-objects,-operations-are-/messages/" class="outline-3">
<h3 id="Integers-are-objects,-operations-are-/messages/"><span class="section-number-3">6.2</span> Integers are objects, operations are <i>messages</i></h3>
<div class="outline-text-3" id="text-Integers-are-objects,-operations-are-/messages/">
<p>
In Ruby, we can move one level of abstraction higher:
all data are objects, and all operations
are <i>messages between objects</i>.
This harkens back to SmallTalk, one of the founding languages
of the object oriented paradigm.
</p>
<div class="org-src-container">
<pre class="src src-ruby">5.send<span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"+"</span>, 3<span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
So even the form <code>x.⊕(y)</code> is syntactic sugar!
</p>

<p>
In Scala, moving to this message passing abstraction
is not possible, at least not easily; why?
</p>
<ul class="org-ul">
<li>Answer: because Scala is statically typed!
It is unlikely the typechecker will parse a string
to see what method is being invoked.
<ul class="org-ul">
<li>And even if we wanted to make the typechecker do so,
that only handles to case of constant strings;
what if the string is constructed earlier in the program,
or its value is given as an argument?</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-Output-methods" class="outline-2">
<h2 id="Output-methods"><span class="section-number-2">7</span> Output methods</h2>
<div class="outline-text-2" id="text-Output-methods">
<p>
There are at least three useful output methods in Ruby.
</p>
<ul class="org-ul">
<li><code>print</code> prints out an object without a newline at the end.</li>
<li><code>puts</code> does output a newline, and on arrays, outputs each element
on its own line.</li>
<li><code>p</code> just outputs raw objects.</li>
</ul>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #f78fe7;">print</span><span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">[</span><span style="color: #79a8ff;">"Prints"</span>, <span style="color: #79a8ff;">"out"</span>, <span style="color: #79a8ff;">"the"</span>, <span style="color: #79a8ff;">"object"</span>, <span style="color: #79a8ff;">"without"</span>, <span style="color: #79a8ff;">"a"</span>, <span style="color: #79a8ff;">"new"</span>, <span style="color: #79a8ff;">"line"</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">print</span> <span style="color: #79a8ff;">"\n"</span>

<span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">[</span><span style="color: #79a8ff;">"Each"</span>, <span style="color: #79a8ff;">"element"</span>, <span style="color: #79a8ff;">"on"</span>, <span style="color: #79a8ff;">"a"</span>, <span style="color: #79a8ff;">"newline"</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"And a newline at the end as well."</span>
<span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"See?"</span>

<span style="color: #f78fe7;">print</span> <span style="color: #79a8ff;">"Outputs a string with a newline\n"</span>
<span style="color: #f78fe7;">p</span> <span style="color: #79a8ff;">"Outputs the raw string\n"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-Postfix-forms" class="outline-2">
<h2 id="Postfix-forms"><span class="section-number-2">8</span> Postfix forms</h2>
<div class="outline-text-2" id="text-Postfix-forms">
<p>
One nice feature of Ruby is that it has
an abuntant amount of syntactic sugar.
For instance, we have the standard control structures
such as <code>if</code>:
</p>
<div class="org-src-container">
<pre class="src src-ruby">x = <span style="color: #b6a0ff;">if</span> 2 + 3 == 5
      <span style="color: #79a8ff;">"2 + 3 is 5; good"</span>
    <span style="color: #b6a0ff;">elsif</span> 2 + 3 == 6
      <span style="color: #79a8ff;">"oh no!!!"</span>
    <span style="color: #b6a0ff;">else</span>
      <span style="color: #79a8ff;">"oh no"</span>
    <span style="color: #b6a0ff;">end</span>

<span style="color: #f78fe7;">print</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"x is: "</span>, x<span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
If you are only using a “then” branch, you can write
the <code>if</code> after the body.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"1 + 1 is 2"</span><span style="color: #00cd68;">)</span> <span style="color: #b6a0ff;">if</span> 1 + 1 == 2
</pre>
</div>


<p>
We can do the same with at least some of the loops
</p>
<div class="org-src-container">
<pre class="src src-ruby">x = 0
y = 0

x = x + 1 <span style="color: #b6a0ff;">while</span> x &lt; 10
<span style="color: #b6a0ff;">while</span> y &lt; 10 <span style="color: #b6a0ff;">do</span> y = y + 1 <span style="color: #b6a0ff;">end</span>

<span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span>x<span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span>y<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
