literate-programs/10-09-Introduction-to-Ruby.org
* Method naming conventions
:PROPERTIES:
:CUSTOM_ID: Method-naming-conventions
:END:

Note; in this section, we use the phrase “by convention” frequently.
This is because the method naming conventions are exactly that:
conventions. Their properties are not actually enforced by Ruby.

By convention, methods ending with a ~?~ are /predicates/.
They do not /necessarily/ return a boolean, but should
return a “truth value” of some kind.
#+begin_src ruby
6.even?
#+end_src

#+RESULTS:
: true

By convention, methods ending with a ~!~ are /destructive/;
they modify the receiver.
#+begin_src ruby :results output
x = [1,3,2]
y = [5,6,4]

x.sort! # Changes the value of x
z = y.sort # Does not change the value of y. 

print("[1,3,2] sorted is ", x, "\n")
print("The original ", y, " did not get sorted; see?\n")
print("Here's the sorted version: ", z)
#+end_src

#+RESULTS:
: [1,3,2] sorted is [1, 2, 3]
: The original [5, 6, 4] did not get sorted; see?
: Here's the sorted version: [4, 5, 6]

See the Ruby documentation on [[https://docs.ruby-lang.org/en/2.7.0/doc/syntax/methods_rdoc.html#label-Method+Names][method names]]
for discussion of the the bang and question mark postfixes.

Methods ending with a ~=~ indicate an /assignment/ method.
These methods should “behave like assignment”.
See the [[https://docs.ruby-lang.org/en/2.7.0/doc/syntax/assignment_rdoc.html#label-Assignment+Methods][Ruby documentation]].
Unlike with the ~?~ and ~!~ postfixes,
*using the ~=~ postfix /does/ actually change the method's behaviour*;
specifically, the return value of a ~=~ method is ignored.
The arguments to the method are returned instead.

Assignment methods can be called using a special syntax;
given an assignment method ~my_attribute=~ and
an instance of the class ~my_instance~,
we can write
#+begin_example ruby
my_instance.my_attribute = "A new value"
#+end_example
instead of
#+begin_example ruby
my_instance.my_attribute=("A new value")
#+end_example

* Defining classes
:PROPERTIES:
:CUSTOM_ID: Defining-classes
:END:

** The basics
:PROPERTIES:
:CUSTOM_ID: The-basics
:END:

A class declaration in Ruby for a class named ~Name~ is
begun by simply saying
#+begin_example ruby
class Name
#+end_example

Instance variables
(whose value is unique per object of the class)
begin with a ~@~.
We do not declare explicitly declare variables in Ruby,
but you can initialise them to “declare” them
(you don't need to though; they can be initialised inside
a constructor or other methods.)

Class variables
(whose value is shared by each object of the class)
begin with a ~@@~.
(In other languages, these are often called ~static~ members.)

It is common to want to define /getters/ and /setters/ for instance
variables in OO programming.
For example,
#+begin_src ruby :results output
class MyContainer
  
  def initialize(thing=nil)
    @thing = thing
  end

  def thing
    @thing
  end

  # Assignment method syntax
  def thing=(thing)
    @thing = thing
  end
end

container = MyContainer.new()
container.thing = 5
puts(container.thing)
#+end_src

#+RESULTS:
: 5

Because this is so common, there is a shorthand
to avoid declaring these methods.
#+begin_src ruby :results output
class MyContainer
  attr_accessor :thing   # :thing is a symbol; essentially in interned string
  # attr_reader   provides only the getter
  # attr_writer   provides only the setter

  def initialize(thing=nil)
    @thing = thing
  end
end

container = MyContainer.new()
container.thing = 5
puts(container.thing)
#+end_src

#+RESULTS:
: 5

:TODO: initialize is the constructor

** Inheritance
:PROPERTIES:
:CUSTOM_ID: Inheritance
:END:

:TODO:

#+begin_src ruby
class C1

class C2 < C1
#+end_src

** TODO Mixins
:PROPERTIES:
:CUSTOM_ID: Mixins
:END:

https://ruby-doc.com/docs/ProgrammingRuby/html/tut_modules.html

** COMMENT Custom lists
:PROPERTIES:
:CUSTOM_ID: COMMENT-Custom-lists
:END:

#+begin_src ruby :results output
# My own class of lists.
# Note that these lists misbehave if you try to store nil in them;
# specifically, lists which start with nil are treated as empty,
# so everything following a nil in the list will be ignored.
class MyList

  # Create readers for two fields, here and next.
  attr_reader :here
  attr_reader :next
  
  # Initialise a list as a singleton or an empty list.
  def initialize(val=nil)
    @here = val
    @next = nil
  end

  # Add a value to the beginning of a list
  # Note that we test if the head (@here) is tested against nil;
  # lists with a nil head are considered to be empty.
  def prepend(val)
    if @here != nil
      # Reproduce the current list, making it the new next list
      @next = self.clone()
    end
    @here = val
    return self
  end

  def catenate(l)
    if @here != nil and @next != nil
      # keep recursing until we reach the end of our list
      @next = @next.catenate(l)
    elsif @here != nil
      # at the end, attach a copy of l
      @next = l.clone()
    else
      # there is no list here; just copy l
      @here = l.here
      @next = l.next
    end
    return self
  end

  def to_s
    if @here and @next
      return @here.to_s + " :: " + @next.to_s
    elsif @here
      return @here.to_s + " :: eol"
    else
      return "eol"
    end
  end

end

# The list containing 1, prepended with 2, catenated with the list containing 3
# 2 ∷ 1 ∷ 3 ∷ eol
puts ((MyList.new(1)).prepend(2)).catenate(MyList.new(3))
#+end_src

#+RESULTS:
: 2 :: 1 :: 3 :: eol
