literate-programs/10-09-Introduction-to-Ruby.html

<div id="outline-container-Method-naming-conventions" class="outline-2">
<h2 id="Method-naming-conventions"><span class="section-number-2">9</span> Method naming conventions</h2>
<div class="outline-text-2" id="text-Method-naming-conventions">
<p>
Note; in this section, we use the phrase “by convention” frequently.
This is because the method naming conventions are exactly that:
conventions. Their properties are not actually enforced by Ruby.
</p>

<p>
By convention, methods ending with a <code>?</code> are <i>predicates</i>.
They do not <i>necessarily</i> return a boolean, but should
return a “truth value” of some kind.
</p>
<div class="org-src-container">
<pre class="src src-ruby">6.even?
</pre>
</div>

<p>
By convention, methods ending with a <code>!</code> are <i>destructive</i>;
they modify the receiver.
</p>
<div class="org-src-container">
<pre class="src src-ruby">x = <span style="color: #00cd68;">[</span>1,3,2<span style="color: #00cd68;">]</span>
y = <span style="color: #00cd68;">[</span>5,6,4<span style="color: #00cd68;">]</span>

x.sort! <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Changes the value of x</span>
z = y.sort <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Does not change the value of y. </span>

<span style="color: #f78fe7;">print</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"[1,3,2] sorted is "</span>, x, <span style="color: #79a8ff;">"\n"</span><span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">print</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"The original "</span>, y, <span style="color: #79a8ff;">" did not get sorted; see?\n"</span><span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">print</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"Here's the sorted version: "</span>, z<span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
See the Ruby documentation on <a href="https://docs.ruby-lang.org/en/2.7.0/doc/syntax/methods_rdoc.html#label-Method+Names">method names</a>
for discussion of the the bang and question mark postfixes.
</p>

<p>
Methods ending with a <code>=</code> indicate an <i>assignment</i> method.
These methods should “behave like assignment”.
See the <a href="https://docs.ruby-lang.org/en/2.7.0/doc/syntax/assignment_rdoc.html#label-Assignment+Methods">Ruby documentation</a>.
Unlike with the <code>?</code> and <code>!</code> postfixes,
<b>using the <code>=</code> postfix <i>does</i> actually change the method's behaviour</b>;
specifically, the return value of a <code>=</code> method is ignored.
The arguments to the method are returned instead.
</p>

<p>
Assignment methods can be called using a special syntax;
given an assignment method <code>my_attribute=</code> and
an instance of the class <code>my_instance</code>,
we can write
</p>
<pre class="example" id="org809d529">
my_instance.my_attribute = "A new value"
</pre>
<p>
instead of
</p>
<pre class="example" id="org01f3450">
my_instance.my_attribute=("A new value")
</pre>
</div>
</div>

<div id="outline-container-Defining-classes" class="outline-2">
<h2 id="Defining-classes"><span class="section-number-2">10</span> Defining classes</h2>
<div class="outline-text-2" id="text-Defining-classes">
</div>

<div id="outline-container-The-basics" class="outline-3">
<h3 id="The-basics"><span class="section-number-3">10.1</span> The basics</h3>
<div class="outline-text-3" id="text-The-basics">
<p>
A class declaration in Ruby for a class named <code>Name</code> is
begun by simply saying
</p>
<pre class="example" id="orgdd7edc5">
class Name
</pre>

<p>
Instance variables
(whose value is unique per object of the class)
begin with a <code>@</code>.
We do not declare explicitly declare variables in Ruby,
but you can initialise them to “declare” them
(you don't need to though; they can be initialised inside
a constructor or other methods.)
</p>

<p>
Class variables
(whose value is shared by each object of the class)
begin with a <code>@@</code>.
(In other languages, these are often called <code>static</code> members.)
</p>

<p>
It is common to want to define <i>getters</i> and <i>setters</i> for instance
variables in OO programming.
For example,
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">MyContainer</span>
  
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>thing=<span style="color: #00bcff;">nil</span><span style="color: #00cd68;">)</span>
    <span style="color: #00d3d0;">@thing</span> = thing
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">thing</span>
    <span style="color: #00d3d0;">@thing</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">Assignment method syntax</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">thing=</span><span style="color: #00cd68;">(</span>thing<span style="color: #00cd68;">)</span>
    <span style="color: #00d3d0;">@thing</span> = thing
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

container = <span style="color: #f78fe7;">MyContainer</span>.new<span style="color: #00cd68;">()</span>
container.thing = 5
<span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span>container.thing<span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
Because this is so common, there is a shorthand
to avoid declaring these methods.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">MyContainer</span>
  <span style="color: #f78fe7;">attr_accessor</span> <span style="color: #00bcff;">:thing</span>   <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">:thing is a symbol; essentially in interned string</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">attr_reader   provides only the getter</span>
  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">attr_writer   provides only the setter</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">initialize</span><span style="color: #00cd68;">(</span>thing=<span style="color: #00bcff;">nil</span><span style="color: #00cd68;">)</span>
    <span style="color: #00d3d0;">@thing</span> = thing
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

container = <span style="color: #f78fe7;">MyContainer</span>.new<span style="color: #00cd68;">()</span>
container.thing = 5
<span style="color: #f78fe7;">puts</span><span style="color: #00cd68;">(</span>container.thing<span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
:TODO: initialize is the constructor
</p>
</div>
</div>

<div id="outline-container-Inheritance" class="outline-3">
<h3 id="Inheritance"><span class="section-number-3">10.2</span> Inheritance</h3>
<div class="outline-text-3" id="text-Inheritance">
<p>
:TODO:
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">C1</span>

<span style="color: #b6a0ff;">class</span> <span style="color: #f78fe7;">C2</span> &lt; <span style="color: #f78fe7;">C1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-Mixins" class="outline-3">
<h3 id="Mixins"><span class="section-number-3">10.3</span> <span class="todo TODO">TODO</span> Mixins</h3>
<div class="outline-text-3" id="text-Mixins">
<p>
<a href="https://ruby-doc.com/docs/ProgrammingRuby/html/tut_modules.html">https://ruby-doc.com/docs/ProgrammingRuby/html/tut_modules.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-10-20 Tue 23:05</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
